In [1]:
import pandas as pd
import numpy as np

In [2]:
df_new = pd.read_csv('new_coal_mw.csv', header=3) #ignore the top 3 rows
#df_new.set_index('Country', inplace=True)

In [3]:
df_new.head()

,Country,2000,2001,2002,2003,2004,2005,2006,2007,2008,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Total 2000-2020
0,Albania,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,Argentina,0,0,0,0,0,0,0,0,0,...,0,0,0,120,0,0,0,0,0,120
2,Australia,0,"1,071",440,885,0,0,0,750,0,...,144,0,0,0,0,0,0,0,0,"3,756"
3,Austria,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,Bangladesh,0,0,0,0,0,0,250,0,0,...,0,0,0,0,0,0,275,0,660,"1,185"

In [9]:
df_new_unpivot = df_new.melt(id_vars = ['Country'], var_name='year', value_name='coal_mw_new')

In [10]:
df_new_unpivot.head()

      Country  year coal_mw_new
0     Albania  2000           0
1   Argentina  2000           0
2   Australia  2000           0
3     Austria  2000           0
4  Bangladesh  2000           0

In [11]:
#Cleaning the dataframe:
df = df_new_unpivot.copy() #giving alias to reduce typing

In [12]:
len(df)

2464

In [24]:
df.dtypes

Country        object
year           object
coal_mw_new    object
dtype: object

In [25]:
#last column should be int, appears to be numeric stored as string. Checking for any decimal values
col = ['coal_mw_new']

In [26]:
df.col.unique()

AttributeError: 'DataFrame' object has no attribute 'col'